app/controllers/autors_controller.rb

  def index
    @autors = Autor.all
---
SELECT "autors".* FROM "autors"

  def create
    @autor = Autor.new(autor_params)

    respond_to do |format|
      if @autor.save
---
INSERT INTO "autors" ("first_name", "second_name", "last_name", "spin", "autor_id", "science_index", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @autor.destroy
---
DELETE FROM "autors" WHERE "autors"."id" = $1  [["id", 1]]

    def set_autor
      @autor = Autor.find(params[:id])
---
SELECT  "autors".* FROM "autors" WHERE "autors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]