app/controllers/publications_controller.rb

  def index
    @publications = Publication.all
---
SELECT "publications".* FROM "publications"

  def destroy
    @publication.destroy
---
DELETE FROM "publications" WHERE "publications"."id" = $1  [["id", 6]]

    def set_publication
      @publication = Publication.find(params[:id])
---
SELECT  "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]