app/controllers/statistics_controller.rb

  def index
    #if params.has_key?(:autor_id)
      #@statistics = Statistic.where(:autor_id => params[:autor_id]).load
    #end
    @statistics = Statistic.first
---
SELECT  "statistics".* FROM "statistics" ORDER BY "statistics"."id" ASC LIMIT $1  [["LIMIT", 1]]